leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxVadc_reg.h
/** \brief  A20, Group, Channel Ctrl. Reg. */
#define VADC_G1_CHCTR8 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0020A20u)

/** Alias (User Manual Name) for VADC_G1_CHCTR8.
* To use register names with standard convension, please use VADC_G1_CHCTR8.
*/
#define	VADC_G1CHCTR8	(VADC_G1_CHCTR8)

/** \brief  A24, Group, Channel Ctrl. Reg. */
#define VADC_G1_CHCTR9 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_CHCTR*)0xF0020A24u)

/** Alias (User Manual Name) for VADC_G1_CHCTR9.
* To use register names with standard convension, please use VADC_G1_CHCTR9.
*/
#define	VADC_G1CHCTR9	(VADC_G1_CHCTR9)

/** \brief  9F0, External Multiplexer Control Register, Group x */
#define VADC_G1_EMUXCTR /*lint --e(923)*/ (*(volatile Ifx_VADC_G_EMUXCTR*)0xF00209F0u)

/** Alias (User Manual Name) for VADC_G1_EMUXCTR.
* To use register names with standard convension, please use VADC_G1_EMUXCTR.
*/
#define	VADC_G1EMUXCTR	(VADC_G1_EMUXCTR)

/** \brief  8A0, Input Class Register */
#define VADC_G1_ICLASS0 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00208A0u)

/** Alias (User Manual Name) for VADC_G1_ICLASS0.
* To use register names with standard convension, please use VADC_G1_ICLASS0.
*/
#define	VADC_G1ICLASS0	(VADC_G1_ICLASS0)

/** \brief  8A4, Input Class Register */
#define VADC_G1_ICLASS1 /*lint --e(923)*/ (*(volatile Ifx_VADC_ICLASS*)0xF00208A4u)

/** Alias (User Manual Name) for VADC_G1_ICLASS1.
* To use register names with standard convension, please use VADC_G1_ICLASS1.
*/
#define	VADC_G1ICLASS1	(VADC_G1_ICLASS1)

/** \brief  90C, Queue 0 Register 0, Group */
#define VADC_G1_Q0R0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R0*)0xF002090Cu)

/** Alias (User Manual Name) for VADC_G1_Q0R0.
* To use register names with standard convension, please use VADC_G1_Q0R0.
*/
#define	VADC_G1Q0R0	(VADC_G1_Q0R0)

/** \brief  94C, Queue 3 Register 0, Group */
#define VADC_G1_Q0R3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_Q0R3*)0xF002094Cu)

/** Alias (User Manual Name) for VADC_G1_Q0R3.
* To use register names with standard convension, please use VADC_G1_Q0R3.
*/
#define	VADC_G1Q0R3	(VADC_G1_Q0R3)

/** \brief  910, Queue 0 Input Register, Group */
#define VADC_G1_QBUR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR0*)0xF0020910u)

/** Alias (User Manual Name) for VADC_G1_QBUR0.
* To use register names with standard convension, please use VADC_G1_QBUR0.
*/
#define	VADC_G1QBUR0	(VADC_G1_QBUR0)

/** \brief  950, Queue 3 Input Register, Group */
#define VADC_G1_QBUR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QBUR3*)0xF0020950u)

/** Alias (User Manual Name) for VADC_G1_QBUR3.
* To use register names with standard convension, please use VADC_G1_QBUR3.
*/
#define	VADC_G1QBUR3	(VADC_G1_QBUR3)

/** \brief  900, Queue 0 Source Control Register, Group */
#define VADC_G1_QCTRL0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL0*)0xF0020900u)

/** Alias (User Manual Name) for VADC_G1_QCTRL0.
* To use register names with standard convension, please use VADC_G1_QCTRL0.
*/
#define	VADC_G1QCTRL0	(VADC_G1_QCTRL0)

/** \brief  940, Queue 3 Source Control Register, Group */
#define VADC_G1_QCTRL3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QCTRL3*)0xF0020940u)

/** Alias (User Manual Name) for VADC_G1_QCTRL3.
* To use register names with standard convension, please use VADC_G1_QCTRL3.
*/
#define	VADC_G1QCTRL3	(VADC_G1_QCTRL3)

/** \brief  910, Queue 0 Input Register, Group */
#define VADC_G1_QINR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR0*)0xF0020910u)

/** Alias (User Manual Name) for VADC_G1_QINR0.
* To use register names with standard convension, please use VADC_G1_QINR0.
*/
#define	VADC_G1QINR0	(VADC_G1_QINR0)

/** \brief  950, Queue 3 Input Register, Group */
#define VADC_G1_QINR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QINR3*)0xF0020950u)

/** Alias (User Manual Name) for VADC_G1_QINR3.
* To use register names with standard convension, please use VADC_G1_QINR3.
*/
#define	VADC_G1QINR3	(VADC_G1_QINR3)

/** \brief  904, Queue 0 Mode Register, Group */
#define VADC_G1_QMR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR0*)0xF0020904u)

/** Alias (User Manual Name) for VADC_G1_QMR0.
* To use register names with standard convension, please use VADC_G1_QMR0.
*/
#define	VADC_G1QMR0	(VADC_G1_QMR0)

/** \brief  944, Queue 3 Mode Register, Group */
#define VADC_G1_QMR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QMR3*)0xF0020944u)

/** Alias (User Manual Name) for VADC_G1_QMR3.
* To use register names with standard convension, please use VADC_G1_QMR3.
*/
#define	VADC_G1QMR3	(VADC_G1_QMR3)

/** \brief  908, Queue 0 Status Register, Group */
#define VADC_G1_QSR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR0*)0xF0020908u)

/** Alias (User Manual Name) for VADC_G1_QSR0.
* To use register names with standard convension, please use VADC_G1_QSR0.
*/
#define	VADC_G1QSR0	(VADC_G1_QSR0)

/** \brief  948, Queue 3 Status Register, Group */
#define VADC_G1_QSR3 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_QSR3*)0xF0020948u)

/** Alias (User Manual Name) for VADC_G1_QSR3.
* To use register names with standard convension, please use VADC_G1_QSR3.
*/
#define	VADC_G1QSR3	(VADC_G1_QSR3)

/** \brief  A80, Group Result Control Reg. */
#define VADC_G1_RCR0 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020A80u)

/** Alias (User Manual Name) for VADC_G1_RCR0.
* To use register names with standard convension, please use VADC_G1_RCR0.
*/
#define	VADC_G1RCR0	(VADC_G1_RCR0)

/** \brief  A84, Group Result Control Reg. */
#define VADC_G1_RCR1 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020A84u)

/** Alias (User Manual Name) for VADC_G1_RCR1.
* To use register names with standard convension, please use VADC_G1_RCR1.
*/
#define	VADC_G1RCR1	(VADC_G1_RCR1)

/** \brief  AA8, Group Result Control Reg. */
#define VADC_G1_RCR10 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020AA8u)

/** Alias (User Manual Name) for VADC_G1_RCR10.
* To use register names with standard convension, please use VADC_G1_RCR10.
*/
#define	VADC_G1RCR10	(VADC_G1_RCR10)

/** \brief  AAC, Group Result Control Reg. */
#define VADC_G1_RCR11 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020AACu)

/** Alias (User Manual Name) for VADC_G1_RCR11.
* To use register names with standard convension, please use VADC_G1_RCR11.
*/
#define	VADC_G1RCR11	(VADC_G1_RCR11)

/** \brief  AB0, Group Result Control Reg. */
#define VADC_G1_RCR12 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020AB0u)

/** Alias (User Manual Name) for VADC_G1_RCR12.
* To use register names with standard convension, please use VADC_G1_RCR12.
*/
#define	VADC_G1RCR12	(VADC_G1_RCR12)

/** \brief  AB4, Group Result Control Reg. */
#define VADC_G1_RCR13 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020AB4u)

/** Alias (User Manual Name) for VADC_G1_RCR13.
* To use register names with standard convension, please use VADC_G1_RCR13.
*/
#define	VADC_G1RCR13	(VADC_G1_RCR13)

/** \brief  AB8, Group Result Control Reg. */
#define VADC_G1_RCR14 /*lint --e(923)*/ (*(volatile Ifx_VADC_G_RCR*)0xF0020AB8u)

